{
    "experience": {
        "main": {
            "Web Developer / Mitsue-Links Co.,Ltd." : {
                "time": "June 2021 - October 2023 / Tokyo, Japan",
                "text": "My job scope was both front-end and back-end development and mainly developed Corporate Websites and SPA with Next.js or Nuxt.js. In terms of Corporate Websites, I implimented some of them with CMS and optimized the operation and maintenance for client. The company policy was focus on Accessiblity following to W3C proposal and best practice. My development policy is influenced by it.",
                "note": ["As for my development policy, please kindly click the 'Profile' tab button above."]
            },
            "Web Developer / Sankaku Company" : {
                "time": "April 2019 - June 2021 / Tokyo, Japan",
                "text": "As a front-end developer, I developed numerous corporate websites and SPAs. The work required dedication to handle an abundance of projects, pushing me to develop and learn as quickly as possible. Additionally, there were many opportunities to collaborate with business partners, allowing me to understand the importance of teamwork in large projects."
            },
            "Private Project Development" : {
                "time": "April 2018 - October 2023 / Tokyo, Japan",
                "text": "I dedicated myself to the development of personal projects on a daily basis to intensively learn technologies and new languages that I wanted to delve into during company development. Valuing continuous learning, I aim to achieve optimal performance in internal projects by applying the knowledge gained through daily learning."
            }
        },
        "other": {
            "Strawberry Picker / Good Planet" : {
                "time": "Norvember 2023 - January 2023 / Auckland, New Zealand",
                "text": "Not only just picking strawberries but also pruning, thinning, and maintaining orchard equipment are my responsibilities. I'm focusing on effectiveness because it requires quickness and courteousness. I always thought 'what is the best way?' to satisfy both of them."
            },
            "Sales and Tour Operator / JTB Corp." : {
                "time": "April 2018 - April 2019 / Tokyo, Japan",
                "text": "My main responsibilities was sales and operating client's travel and convention but also including tour attendant jobs and simple interpretation."
            },
            "Tennis Coach / Konami Sports" : {
                "time": "April 2014 - April 2018 / Saitama, Japan",
                "text": "As a tennis coach, I am dedicated to improving customers' tennis skills, catering to individuals of all ages, from kids to elderly people, and from beginners to advanced players."
            },
            "Beverage Factory Worker" : {
                "time": "November 2015 - June 2016 / Melbourne, Australia",
                "text": "Making juice involves ordering the required amount of vegetables and fruits, scaling, cutting, squashing, mixing, pouring into a bottle, labeling, and delivering. The work is done by cooperating with multinational co-workers."
            }
        }
    },
    "works": {
        "Calendar App" : {
            "detail": {
                "CLIENT": "Private Project",
                "Technology": "Dummy Technology",
                "Design": "All with Adobe XD",
                "Note": ["I created a calendar app to deepen my understanding of two aspects: the latest technologies in React and the integration of client-side and server-side development.", "In my previous workplace, there were cases where responsibilities were highly specialized, leading to separate development of front-end and back-end. This often resulted in integrating these components in the final stages of the project.", "Therefore, wanting to enhance my understanding of the integration, I intentionally assumed separate development responsibilities for each and created them in distinct repositories, then integrated these components via a proxy server.", "As a result, I gained valuable insights into optimal project directory structures, HTTP endpoint configurations, proxy server setup, and use cases for such development methodologies."],
                "PERIOD": "July 2023 - September 2023",
                "LINK": [["https://tika-calendar-app.glitch.me/"], "System does not work because this app is developed with PHP8 and cannot prepare PaaS supporting PHP8"]
            },
            "srcText": ["SP 1", "SP 2"]
        },
        "Tamagawa University Corporate Website" : {
            "detail": {
                "CLIENT": "Tamagawa University",
                "Technology": "TypeScript, HTML5, CSS3, Movable Type",
                "Design": "UX, Animation",
                "Note": ["I was mainly in charge of a renewal of a huge university's Corporate Website with 4 team members.", "My responsibilities were both the frontend and the backend, considering UX and animation, and team management. When it comes to the backend, I implemented my frontend development into Movable Type so that the client is also able to manage a plenty of contents by himself.", "I experienced the almost all process of this huge project, so from project manager's perspective as well, I was able to develop with concentration on the project's scope, volumes and budget for each task, human resources, team and progress management, and so on."],
                "PERIOD": "June 2022 - March 2023",
                "LINK": [["https://www.tamagawa.jp/", "https://www.tamagawa.jp/university/", "https://www.tamagawa.jp/academy/"], false] 
            },
            "srcText": ["SP 1", "SP 2"]
        },
        "Flash Card App" : {
            "detail": {
                "CLIENT": "Private Project",
                "Technology": "Vue3, TypeScript, Express",
                "Design": "All with Adobe XD",
                "Note": ["To deepen my understanding of Vue.js and to consolidate usage of best practice for data manipulation, I developed Flash Card App with modern App design.", "I actively used new Vue.js functionality at that moment, such as script setup mode, v-memo, provide, and inject in reference well to official documents. In addition to I focused on decent data manipulation as reinvestigating usages of Axious and Vuex, and the concept of Restful API.", "What I re-realized this time was the importance of updating my knowledge about the web and incorporating the latest technologies into everyday web development by regularly developing private applications and delving deep into specific fields.", "Regarding Vue.js, there had been significant updates since my previous knowledge, improving code readability and performance in app development. This development project was a valuable experience for me to familiarize myself with the latest Vue.js advancements."],
                "PERIOD": "August 2022 - December 2022",
                "LINK": [["https://tika-flashcard.glitch.me/"], "It might take time to activate because this app is on PaaS and needs to be set up"]
            },
            "srcText": ["SP 1", "SP 2"]
        },
        "Chat App" : {
            "detail": {
                "CLIENT": "Private Project",
                "Technology": "Vue3, TypeScript, Express",
                "Design": "All with Adobe XD",
                "Note": ["I privately developed Chat App imitating some WhatsApp App functionalities. The core of the App is the mutual communication realized by Websocket implemented with Node.js's Socket.IO library.", "Until then, I only knew HTTP as the communication protocol between the client-side and server-side. However, through this project, I learned about a new communication protocol called WebSocket, and I gained an understanding of its usefulness. Particularly, the ability to send information from the server-side to the client-side, which is not present in HTTP, was a concept that I found meaningful for future web application development."],
                "PERIOD": "February 2022 - June 2022",
                "LINK": [["https://snow-chat.glitch.me/"], "It might take time to activate because this app is on PaaS and needs to be set up"]
            },
            "srcText": ["SP 1", "SP 2"]
        },
        "Nap Art App" : {
            "detail": {
                "CLIENT": "Ohirune Art Association",
                "Technology": "Vue3",
                "Design": "UX",
                "Note": ["I developed an SPA where users can create handmade artwork capturing their baby's cuteness and cherished moments by processing children's photos with provided background templates and decorative images through intuitive UI operations", "The difficulties I faced in this project were related to the integration of the frontend and backend", " I was responsible not only for frontend development but also for integration, while the backend was developed by our partner company. However, their technologies, Twig and EC-CUBE, were completely unfamiliar to me, so I was somewhat confused when I first saw their code.", "Nevertheless, with my consciously active effort to engage in meaningful conversations with a backend developer and quickly investigate their technologies, that initial confusion gradually dissipated, and I successfully reached completion.", "The experience, including learning how to collaborate with others, how to efficiently investigate even unfamiliar information, and how to maintain composure during confusion to carry out what I should do, undoubtedly led to a significant growth in my development as a developer."],
                "PERIOD": "December 2020 - April 2021",
                "LINK": "Non Available for Compliance Reason"
            },
            "srcText": ["SP 1", "SP 2"]
        },
        "My Inquiry Form Template" : {
            "detail": {
                "CLIENT": "Template for Client's Inquiry Form",
                "Technology": "PHP, HTML5, CSS3",
                "Design": "All with Adobe XD",
                "Note": ["In my previous company, we received many requests to create an inquiry form, so I developed a template which is fully covering any potential security risk and customizable for any irregular form elements", "As a result, we was able to not only successfully shortened the development period, but also by showing the template to client when received, it became easier  for project managers to suggest and explain to clients what is important on inquiry form and how would its functionalities become."],
                "PERIOD": "April 2023 - June 2023",
                "LINK": [["https://tika-inquiry-form.glitch.me/"],"System does not work because this app is developed with PHP8 and cannot prepare PaaS supporting PHP8"]
            },
            "srcText": ["SP 1", "SP 2"]
        },
        "TOSO Corporate Website" : {
            "detail": {
                "CLIENT": "TOSO CO.,LTD.",
                "Technology": "Vue3, API Integration",
                "Design": "Not In Charge",
                "Note": ["I developed a Corporate Website for a client specializing in interior furniture, particularly curtain-related products, with my team.", "We chose to implement Vue.js because the website required a plenty of versatile UI elements and functionalities. Besides, the Website had to introduce their products with a variety of details, so we adopted Vue3 and API Integration to efficiently and easily manage them.", "I learned Vue.js from the foundation to the advanced through this project."],
                "PERIOD": "Octorber 2020 - June 2021",
                "LINK": [["https://www.toso.co.jp/"], false]
            },
            "srcText": ["SP 1", "SP 2"]
        },
        "Schick Evangelion Collabo LP" : {
            "detail": {
                "CLIENT": "Schick Japan K.K.",
                "Technology": "HTML5, CSS3, TypeScript",
                "Design": "UX, Animation",
                "Note": ["I developed Landing Page to promote client's products, mainly shaving, collaborated with famous Animation of Evangelion. Image of both shaving and Evangelion are something like masculine, powerful, and robotic, so I considered animations matching with such image and implemented the rich scroll-besed-animation.", "I am very proud of myself that I developed this LP with short period."],
                "PERIOD": "January 2021 - February 2021",
                "LINK": "Non Available for Compliance Reason" 
            },
            "srcType": "movie",
            "srcText": ["MOVIE PC", "MOVIE SP"]
        },
        "Desktop App for Deliverables" : {
            "detail": {
                "CLIENT": "Private Project",
                "Technology": "Electron, Node.js, Vue3, TypeScript, Shell Scripting, Git command",
                "Design": "All with Adobe XD",
                "Note": ["I developed this Desktop Application to reduce the working hours spent on chronic routine tasks.", "In my previous company, we had one client paying us over $2,000,000 annually and giving a plenty of tasks almost all day and parallelly. When each task finished, they required us a unique workflow for delivering a creation to get rid of any problems. That workflow was done with Git and double-check by other team member, and easy for one step but needed many steps to be done, such as frequent branch changes, or request message for double-check to others. Additionally this workflow had to be done many times a day by almost of all members of our team. It means that the total time spending for this client was huge.", "Therefore I developed this App. By filling the blanks with necessary information for the workflow on the application screen, it became possible to automatically and mechanically complete the followings, to switch branches, to generate request messages to other team members, and to detect potential errors. In other words, the workflow became to be done with a few steps.", "Consequently this App significantly contributed to reducing time within the team."],
                "PERIOD": "November 2022 - April 2023"
            },
            "srcType": "desktop",
            "srcText": ["1: Enter details about deliverables and click the start button", "2: Check if deliverables have no problem with WinMerge which is automatically shown up by App", "3: Click the check button to detect potential problems", "4: Confirm the problems according to the error messages", "5: Fix the problems, then click the check button again", "6: If all OK, App tells you that deliverables have no problem"]
        }
    },
    "strength": {
        "Communicative": ["I am an effective communicator with team members and clients. To proceed our tasks properly I mainly focus on 3 points below.", [["Grasp Other's Opinion", "I properly grasp other people's points of view by giving them enough opportunities and time to express their opinion with comfortable atmosphere, and carefully listen with asking precise questions."], ["Give My Opinion", "I always try giving my opinion with thinking about what is the better way to make my opinion understandable for other people, and the impact of their feeling and motivation. However not only those but also I put my emotion onto my opinion to tell how I think and feel. It is depending on the situation, though."], ["Consider Other's Circumstance'", "Thoughts and opinions are influenced by various factors such as the current situation, a person's personality, and background. Therefore, I am always conscious of considering these factors and strive to understand indirect elements, such as why they arrived at certain thoughts."]]],
        "Consideration": ["When I work, I value consideration. This is because consideration brings positive outcomes in various aspects, such as effective communication with others, efficiency in work, and contributions to team motivation. Below, I provide three examples of my consideration:", [["Consideration for Others", "I consistently take into account the perspectives and needs of team members, fostering a collaborative relationship and atmosphere in working environment."], ["Consideration for Decision-Making", "My decision-making process is characterized by thoughtful consideration, where I analyze information comprehensively and evaluate the potential influence on both short-term goals and long-term objectives."], ["Consideration for UI and UX", "I consider from different types of perspectives, such as accessibility, usability, performance, and readability, as a developer by trying to imagine myself as a user of the application or a client who is supposed to release it."]]],
        "Growth-mindset": ["I am proactive in finding ways for improving daily simple processes or solving existing problems. It always results in great breakthrough and efficiency increase.", "The followings are examples how I am proactive.", [["Learn Technique Accelerating My Work", "Developers tend to focus on learning new programming languages and concepts, but I also put importance onto learning techniques that make my daily developing accelerate and facilitate. Regex, Linux command, usuful npm package or VSCode extensions, and deeper understanding about usages of each developing tool are matched to it."],["Create Usuful Desktop App", "In my previous company, I actively created a desktop application using Electron, implemented with an intuitive UI, to reduce the working hours spent on chronic routine tasks. This application simplified manual processes such as file transfers, message sending, and Git operations, bundling them into a few app interactions. As a result, it significantly shortened the overall team working hours."], ["Share and Share", "I share what I thought useful among my team. I believe this activity makes share-and-share circulation and all developers can automatically improve their developing way."]]],
        "Detail-oriented": ["I approach my tasks with a keen attention to detail. I firmly believe that being detail-oriented directly impacts the quality of a project. I do not compromise on quality and am committed to enhancing it by paying careful attention to every detail.", "In terms of web development, I go beyond surface-level of coding and focus on the following 4 perspectives.", [["Accessibility","Ensuring services are usable by individuals facing any challenges."],["Performance","Optimizing the seamless operation under any environments."],["Usability","Implementing the user-friendly interfaces that provide a wide users with easy-to-use and easy-to understand UI and UX."],["Readability","Creating services with straightforward code and robust systems. My work is centered around a meticulous focus on details to deliver top-notch results."]]],
        "Studious": ["I consistently deepen and broaden my understanding of programming languages and systematic concepts. This effort is not only to keep pace with the rapid changes in the IT mainstream but also to increase what I can contribute to the company and projects.", "To achieve this commitment, I focus on the following three points:", [["First","Investigating any unknown expertises encountered during work, promptly researching them, and if it is time-consuming, taking notes, and then making dedicated time to research them."],["Second","Allocating 30 minutes each day to explore new technologies and areas where my understanding may be lacking."],["Third","Initiating personal projects when any breakthrough new technology is necessary, enhancing my understanding through trial and error in the process."]]],
        "Adaptability": ["I possess adaptability to complicated environments or technologies. I believe that it is a crucial trait for successful development in IT field. The reasons are the followings.", [["Technologies Changes Rapidly","Technologies changes with fast-pace. That is why adaptability and quick-learning are required any time, to make optimal proposals that meet the needs of our client, and to develop in the best way at that moment."], ["Collaboration with Various People", "Many people are involving in a project. Some are in different position. Others are in charge of different technologies. To advance our project smoothly, we need to adapt to circumstance and collaborate each other."], ["We Do Not Have Enough Time", "Developing an application frequently requires hard-working due to short deadline, delay of schedule, or immidiate necesity of creating a mockup. To be honest, there is not time for adapting in such case. We need to adapt in no time and allocate as much time as possible for development."]]]
    }
}